bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51J20A.atdf
      <value-group name="SDHC_NISTR__ERRINT">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__TRFC">
        <value name="NO" caption="Not complete" value="0"/>
        <value name="YES" caption="Command execution is completed" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__ACMD">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__ADMA">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDCRC">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="CRC Error Generated" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDEND">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="End Bit Error Generated" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDIDX">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDTEO">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CURLIM">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Power Fail" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__DATCRC">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__DATEND">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__DATTEO">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__BOOTAE">
        <value name="0" caption="FIFO contains at least one byte" value="0"/>
        <value name="1" caption="FIFO is empty" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__BLKGE">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__BRDRDY">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__BWRRDY">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CINS">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CINT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CMDC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CREM">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__DMAINT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__TRFC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__ACMD">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__ADMA">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__CMDCRC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__CMDEND">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__CMDIDX">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__CMDTEO">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__CURLIM">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__DATCRC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__DATEND">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTER__DATTEO">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__BLKGE">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__BRDRDY">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__BWRRDY">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
