bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51J20A.atdf
        <register name="TPR" offset="0xE40" rw="RW" size="4" access-size="4" caption="ITM Trace Privilege Register">
          <bitfield name="PRIVMASK" caption="" mask="0xF"/>
        </register>
        <register name="TCR" offset="0xE80" rw="RW" size="4" access-size="4" caption="ITM Trace Control Register">
          <bitfield name="ITMENA" caption="" mask="0x1"/>
          <bitfield name="TSENA" caption="" mask="0x2"/>
          <bitfield name="SYNCENA" caption="" mask="0x4"/>
          <bitfield name="DWTENA" caption="" mask="0x8"/>
          <bitfield name="SWOENA" caption="" mask="0x10"/>
          <bitfield name="STALLENA" caption="" mask="0x20"/>
          <bitfield name="TSPrescale" caption="" mask="0x300"/>
          <bitfield name="GTSFREQ" caption="" mask="0xC00"/>
          <bitfield name="TraceBusID" caption="" mask="0x7F0000"/>
          <bitfield name="BUSY" caption="" mask="0x800000"/>
        </register>
        <register name="IWR" offset="0xEF8" rw="W" size="4" access-size="4" caption="ITM Integration Write Register">
          <bitfield name="ATVALIDM" caption="" mask="0x1"/>
        </register>
        <register name="IRR" offset="0xEFC" rw="R" size="4" access-size="4" caption="ITM Integration Read Register">
          <bitfield name="ATREADYM" caption="" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instruction and Data Memory MapsRegions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of Data Regions" mask="0xFF00"/>
          <bitfield name="IREGION" caption="Number of Instruction Regions" mask="0xFF0000"/>
        </register>
        <register name="CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU Enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="Enable Hard Fault and NMI handlers" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Enables privileged software access to default memory map" mask="0x4"/>
        </register>
        <register name="RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Region referenced by RBAR and RASR" mask="0xFF"/>
        </register>
        <register name="RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="REGION" caption="Region number" mask="0xF"/>
          <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
          <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RASR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Attribute and Size Register">
          <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
          <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
          <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
          <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
          <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
          <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
          <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
          <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
          <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
        </register>
        <register name="RBAR_A1" offset="0x14" rw="RW" size="4" access-size="4" caption="MPU Alias 1 Region Base Address Register">
          <bitfield name="REGION" caption="Region number" mask="0xF"/>
          <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
          <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RASR_A1" offset="0x18" rw="RW" size="4" access-size="4" caption="MPU Alias 1 Region Attribute and Size Register">
          <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
          <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
          <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
          <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
          <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
          <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
          <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
          <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
          <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
        </register>
        <register name="RBAR_A2" offset="0x1C" rw="RW" size="4" access-size="4" caption="MPU Alias 2 Region Base Address Register">
          <bitfield name="REGION" caption="Region number" mask="0xF"/>
          <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
          <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RASR_A2" offset="0x20" rw="RW" size="4" access-size="4" caption="MPU Alias 2 Region Attribute and Size Register">
          <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
          <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
          <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
          <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
          <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
          <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
          <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
          <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
          <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
        </register>
        <register name="RBAR_A3" offset="0x24" rw="RW" size="4" access-size="4" caption="MPU Alias 3 Region Base Address Register">
          <bitfield name="REGION" caption="Region number" mask="0xF"/>
          <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
          <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RASR_A3" offset="0x28" rw="RW" size="4" access-size="4" caption="MPU Alias 3 Region Attribute and Size Register">
          <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
          <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
          <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
          <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
          <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
          <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
          <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
          <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
          <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
        </register>
      </register-group>
    </module>
    <module name="NVIC" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="ISER" offset="0x0" rw="RW" size="4" access-size="4" count="5" initval="0" caption="Interrupt Set Enable Register">
          <bitfield name="SETENA" caption="Interrupt set enable bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" count="5" initval="0" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="5" initval="0" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="5" initval="0" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IABR" offset="0x200" rw="RW" size="4" access-size="4" count="5" initval="0" caption="Interrupt Active Bit Register">
          <bitfield name="ACTIVE" caption="Interrupt active bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IP" offset="0x300" rw="RW" size="1" access-size="1" count="35" initval="0" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x7"/>
        </register>
